-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 30, 2025 at 09:21 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `grade_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_course_info`
--

CREATE TABLE `tb_course_info` (
  `id` int(11) NOT NULL,
  `teacher_name` varchar(255) DEFAULT NULL,
  `semester` varchar(50) DEFAULT NULL,
  `year` varchar(50) DEFAULT NULL,
  `subject_name` varchar(255) DEFAULT NULL,
  `subject_code` varchar(50) DEFAULT NULL,
  `level_class` varchar(100) DEFAULT NULL,
  `school_name` varchar(255) DEFAULT NULL,
  `teacher_password` varchar(20) DEFAULT '99999'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_course_info`
--

INSERT INTO `tb_course_info` (`id`, `teacher_name`, `semester`, `year`, `subject_name`, `subject_code`, `level_class`, `school_name`, `teacher_password`) VALUES
(2, 'นายปัณณวิชญ์ ธรรมโร', '2', '2568', 'ภาษาอังกฤษพื้นฐาน', 'อ33102', 'ม.6', 'โรงเรียนบ้านสวน (จั่นอนุสรณ์)', '98765'),
(3, 'นายปัณณวิชญ์ ธรรมโร', '2', '2568', 'ภาษาอังกฤษสารสนเทศ 4', 'อ32202', 'ม.5', 'โรงเรียนบ้านสวน (จั่นอนุสรณ์)', '98765');

-- --------------------------------------------------------

--
-- Table structure for table `tb_exam_answer_log`
--

CREATE TABLE `tb_exam_answer_log` (
  `log_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `std_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `student_answer` text DEFAULT NULL,
  `is_correct` int(11) DEFAULT 0,
  `score_earned` float DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tb_exam_questions`
--

CREATE TABLE `tb_exam_questions` (
  `question_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `question_type` int(11) DEFAULT 1,
  `question_text` text NOT NULL,
  `image_path` varchar(255) DEFAULT NULL,
  `audio_path` varchar(255) DEFAULT NULL,
  `choice_a` text NOT NULL,
  `choice_b` text NOT NULL,
  `choice_c` text NOT NULL,
  `choice_d` text NOT NULL,
  `correct_answer` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tb_exam_results`
--

CREATE TABLE `tb_exam_results` (
  `result_id` int(11) NOT NULL,
  `exam_id` int(11) NOT NULL,
  `std_id` int(11) NOT NULL,
  `start_time` datetime DEFAULT NULL,
  `submit_time` datetime DEFAULT NULL,
  `score_obtained` float DEFAULT 0,
  `cheat_count` int(11) DEFAULT 0 COMMENT 'จำนวนครั้งที่สลับหน้าจอ',
  `status` int(11) DEFAULT 0 COMMENT '0=กำลังทำ, 1=ส่งแล้ว'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tb_exam_sets`
--

CREATE TABLE `tb_exam_sets` (
  `exam_id` int(11) NOT NULL,
  `work_id` int(11) NOT NULL COMMENT 'ผูกกับงานไหนใน tb_work',
  `exam_name` varchar(255) NOT NULL COMMENT 'ชื่อชุดข้อสอบ',
  `time_limit` int(11) DEFAULT 60 COMMENT 'เวลาสอบ (นาที)',
  `is_active` int(11) DEFAULT 0 COMMENT '0=ปิดสอบ, 1=เปิดสอบ',
  `random_question` int(11) DEFAULT 1 COMMENT '1=สุ่มข้อ',
  `random_choice` int(11) DEFAULT 1 COMMENT '1=สุ่มช้อยส์',
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_exam_sets`
--

INSERT INTO `tb_exam_sets` (`exam_id`, `work_id`, `exam_name`, `time_limit`, `is_active`, `random_question`, `random_choice`, `created_at`) VALUES
(1, 10, 'แบบทดสอบ: 2. Conditional Sentence', 10, 1, 1, 1, '2025-11-30 13:35:21');

-- --------------------------------------------------------

--
-- Table structure for table `tb_score`
--

CREATE TABLE `tb_score` (
  `score_id` int(11) NOT NULL,
  `std_id` int(11) NOT NULL,
  `work_id` int(11) NOT NULL,
  `score_point` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tb_students`
--

CREATE TABLE `tb_students` (
  `id` int(11) NOT NULL,
  `std_no` int(11) NOT NULL,
  `std_code` varchar(5) NOT NULL,
  `title` varchar(50) NOT NULL,
  `firstname` varchar(100) NOT NULL,
  `lastname` varchar(100) NOT NULL,
  `room` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_students`
--

INSERT INTO `tb_students` (`id`, `std_no`, `std_code`, `title`, `firstname`, `lastname`, `room`) VALUES
(4, 2, '22700', 'นาย', 'ธัญเทพ', 'นวลสุมา', 'ม.5/1'),
(5, 3, '22707', 'นาย', 'ศุภมิตร', 'ถึกสถิตย์', 'ม.5/1'),
(6, 4, '22708', 'นาย', 'ศุภวิชญ์', 'ช้างดี', 'ม.5/1'),
(7, 5, '22740', 'นาย', 'ธนวัฒน์', 'ทองเย็น', 'ม.5/1'),
(8, 6, '22741', 'นาย', 'ธรรมรัตน์', 'สมทิพย์', 'ม.5/1'),
(9, 7, '22861', 'นาย', 'ชัยภัทร', 'สังนาค', 'ม.5/1'),
(10, 8, '22864', 'นาย', 'เทพภกรณ์', 'จันทร์แก้ว', 'ม.5/1'),
(11, 9, '22917', 'นาย', 'ภูริพัฒน์', 'ทับดารา', 'ม.5/1'),
(12, 10, '23273', 'นาย', 'มณฑสิฐ', 'อำไพสิริวงศ์', 'ม.5/1'),
(13, 11, '25014', 'นาย', 'ธราธิป', 'พลพิมพ์', 'ม.5/1'),
(14, 12, '22713', 'น.ส.', 'กนิษฐา', 'ขันทะศิลา', 'ม.5/1'),
(15, 13, '22716', 'น.ส.', 'ธารธาตรา', 'แพร่งสุวรรณ์', 'ม.5/1'),
(16, 14, '22720', 'น.ส.', 'พัชรพร', 'บุญทนาวงษ์', 'ม.5/1'),
(17, 15, '22725', 'น.ส.', 'ลักษณารีย์', 'ศิริโส', 'ม.5/1'),
(18, 16, '22751', 'น.ส.', 'กานชนก', 'ปิยะกาญจน์', 'ม.5/1'),
(19, 17, '22753', 'น.ส.', 'ชลทิพย์', 'เหมือนสุวรรณ์', 'ม.5/1'),
(20, 18, '22759', 'น.ส.', 'ธิชาดา', 'ผลเจริญ', 'ม.5/1'),
(21, 19, '22762', 'น.ส.', 'ฝนทอง', 'ศรีตรัย', 'ม.5/1'),
(22, 20, '22763', 'น.ส.', 'ภคพร', 'ติสนธิ', 'ม.5/1'),
(23, 21, '22805', 'น.ส.', 'พิชญา', 'ศรีโพนทอง', 'ม.5/1'),
(24, 22, '22812', 'น.ส.', 'สุชาดา', 'สีเผือก', 'ม.5/1'),
(25, 23, '22841', 'น.ส.', 'ธิติมา', 'ดวงรัตน์', 'ม.5/1'),
(26, 24, '22858', 'น.ส.', 'อรณิชา', 'รัตนธารส', 'ม.5/1'),
(27, 25, '23078', 'น.ส.', 'วรรณพร', 'บูรพา', 'ม.5/1'),
(28, 26, '23196', 'น.ส.', 'ณัฏฐณิชา', 'มะลัย', 'ม.5/1'),
(29, 27, '23204', 'น.ส.', 'ภัคนรินทร์', 'สุขแจ่ม', 'ม.5/1'),
(30, 28, '25015', 'น.ส.', 'กัญนิภา', 'ช่วยงาน', 'ม.5/1'),
(31, 29, '25016', 'น.ส.', 'กันยามาศ', 'มาลัย', 'ม.5/1'),
(32, 30, '25017', 'น.ส.', 'กานต์ธิดา', 'เพ็ชรเลิศ', 'ม.5/1'),
(33, 31, '25018', 'น.ส.', 'เขมพัฐศร', 'ชูดวง', 'ม.5/1'),
(34, 32, '25019', 'น.ส.', 'ณิชาภา', 'เขมภัทรกาญจน์', 'ม.5/1'),
(35, 33, '25020', 'น.ส.', 'เนตรชนก', 'เเปงปัญญา', 'ม.5/1'),
(36, 34, '25021', 'น.ส.', 'พลอยจุฑา', 'ใจกล้า', 'ม.5/1'),
(37, 35, '25022', 'น.ส.', 'วรรณิดา', 'บัวสี', 'ม.5/1'),
(38, 36, '25023', 'น.ส.', 'วรลักษณ์', 'ถาวร', 'ม.5/1'),
(39, 37, '25024', 'น.ส.', 'ศศิธร', 'เชื้อเกตุ', 'ม.5/1'),
(40, 38, '25025', 'น.ส.', 'ศิวพร', 'สกุลดิเรก', 'ม.5/1'),
(41, 39, '25026', 'น.ส.', 'สุริมน', 'จูรุ่งเรือง', 'ม.5/1'),
(42, 40, '25027', 'น.ส.', 'อัญธิญา', 'เมฆชุ่ม', 'ม.5/1'),
(43, 1, '22736', 'นาย', 'ณัฐพล', 'คำมูล', 'ม.5/6'),
(44, 2, '22773', 'นาย', 'กันตภณ', 'มั่งมีผล', 'ม.5/6'),
(45, 3, '22825', 'นาย', 'ทัตพงศ์', 'จันทา', 'ม.5/6'),
(46, 4, '22910', 'นาย', 'ชัชนันท์', 'ศุภมิตรธัญญากร', 'ม.5/6'),
(47, 5, '22921', 'นาย', 'สิทธิกาญจน์', 'ศรีณภู', 'ม.5/6'),
(48, 6, '23051', 'นาย', 'พันแสน', 'มาพิมพ์', 'ม.5/6'),
(49, 7, '23058', 'นาย', 'สิรภพ', 'เกิดสมบัติ', 'ม.5/6'),
(50, 8, '23134', 'นาย', 'ธีรวัช', 'ดุลยรัตน์', 'ม.5/6'),
(51, 9, '22756', 'น.ส.', 'ณัฐนิชา', 'โป้บุญมา', 'ม.5/6'),
(52, 10, '22764', 'น.ส.', 'วนาวรรณ', 'กันหฤกษ์', 'ม.5/6'),
(53, 11, '22770', 'น.ส.', 'อภิรดา', 'สุรพัตร', 'ม.5/6'),
(54, 12, '22813', 'น.ส.', 'อภิชญา', 'เหลืองอ่อน', 'ม.5/6'),
(55, 13, '22835', 'น.ส.', 'กฤติยาณี', 'แก้วซิ้ม', 'ม.5/6'),
(56, 14, '22846', 'น.ส.', 'ยุภาพักตร์', 'ยั่งยืน', 'ม.5/6'),
(57, 15, '22893', 'น.ส.', 'พัชราภา', 'สัตยกุล', 'ม.5/6'),
(58, 16, '22923', 'น.ส.', 'เกวลิน', 'รวงผึ้ง', 'ม.5/6'),
(59, 17, '22924', 'น.ส.', 'เกสรา', 'สมจิต', 'ม.5/6'),
(60, 18, '22935', 'น.ส.', 'น้ำฟ้า', 'หาญจับพาล', 'ม.5/6'),
(61, 19, '22975', 'น.ส.', 'ขวัญพิชชา', 'สนิทกูล', 'ม.5/6'),
(62, 20, '22986', 'น.ส.', 'เพชราภรณ์', 'สัตยกุล', 'ม.5/6'),
(63, 21, '23063', 'น.ส.', 'กฤษณา', 'แซ่เติ๋น', 'ม.5/6'),
(64, 22, '23071', 'น.ส.', 'นภสร', 'ธัญญเจริญ', 'ม.5/6'),
(65, 23, '23112', 'น.ส.', 'คุณัญญา', 'ค้อมสิงห์', 'ม.5/6'),
(66, 24, '23114', 'น.ส.', 'ณัฐปภัสร์', 'จันทร์หอม', 'ม.5/6'),
(67, 25, '23122', 'น.ส.', 'ลลิตภัทร', 'เจริญแสนสวย', 'ม.5/6'),
(68, 26, '23162', 'น.ส.', 'พิชชาภรณ์', 'ชูทรัพย์', 'ม.5/6'),
(69, 27, '23190', 'น.ส.', 'กฤษฎาภา', 'รังสิโยภาส', 'ม.5/6'),
(70, 28, '23209', 'น.ส.', 'สุนิสา', 'ใจชื่น', 'ม.5/6'),
(71, 29, '23280', 'น.ส.', 'พิชชานันท์', 'กล้าหาญ', 'ม.5/6'),
(72, 30, '25081', 'น.ส.', 'กัณฑมาศ', 'คุ้ยร้านหญ้า', 'ม.5/6'),
(73, 31, '25082', 'น.ส.', 'ณัฐภัทร', 'พันธ์ภา', 'ม.5/6'),
(74, 32, '25083', 'น.ส.', 'ฐิติชญาน์', 'ศรีคำไทย', 'ม.5/6'),
(75, 33, '25084', 'น.ส.', 'จีรวรรณ', 'มณีรัตน์', 'ม.5/6'),
(76, 34, '25085', 'น.ส.', 'ณิชานันท์', 'เมฆสุวรรณ', 'ม.5/6'),
(77, 35, '25086', 'น.ส.', 'ธารธารา', 'อนุรพันธ์', 'ม.5/6'),
(78, 36, '25087', 'น.ส.', 'อริสา', 'กุลวานิช', 'ม.5/6'),
(79, 37, '25088', 'น.ส.', 'ฐิตารีย์', 'ภูวการันย์วงษ์', 'ม.5/6'),
(80, 38, '25089', 'น.ส.', 'สิปาง', 'สาครรัตน์', 'ม.5/6'),
(81, 39, '25090', 'น.ส.', 'อารีพร', 'ราศรีจันทร์', 'ม.5/6'),
(82, 40, '25091', 'น.ส.', 'ภิญญาพัชญ์', 'เเซ่เตียว', 'ม.5/6'),
(83, 1, '22114', 'นาย', 'เพิ่มศักดิ์', 'เสมอวงษ์', 'ม.6/1'),
(84, 2, '22118', 'นาย', 'สิทธิพงษ์', 'เฉลียวพงษ์', 'ม.6/1'),
(85, 3, '22138', 'นาย', 'ธินกร', 'ประวันนา', 'ม.6/1'),
(86, 4, '22148', 'นาย', 'อริยวัฒน์', 'สุวรรณแสงศรี', 'ม.6/1'),
(87, 5, '22149', 'นาย', 'อิทธิพัทธ์', 'เทพวงค์', 'ม.6/1'),
(88, 6, '22181', 'นาย', 'ธีระ', 'เอมพันธ์', 'ม.6/1'),
(89, 7, '22235', 'นาย', 'อาสาฬห์', 'ดวงกำ', 'ม.6/1'),
(90, 8, '22323', 'นาย', 'สุรวิชญ์', 'ธรรมวิชญ์', 'ม.6/1'),
(91, 9, '24399', 'นาย', 'ธีรภัทร', 'ฉั่วยู่เน้ย', 'ม.6/1'),
(92, 10, '25130', 'นาย', 'อภิชัย', 'ฉายยิ่งเชี่ยว', 'ม.6/1'),
(93, 11, '22120', 'น.ส.', 'จันทรวรรณ', 'หงษ์ห้อย', 'ม.6/1'),
(94, 12, '22121', 'น.ส.', 'จิณณพัต', 'ปะนันโต', 'ม.6/1'),
(95, 13, '22124', 'น.ส.', 'นวพร', 'วงษ์สว่าง', 'ม.6/1'),
(96, 14, '22127', 'น.ส.', 'พิรดา', 'โพธิ์มิ', 'ม.6/1'),
(97, 15, '22129', 'น.ส.', 'รัชฎาพร', 'คำช่าง', 'ม.6/1'),
(98, 16, '22156', 'น.ส.', 'ปัณณพร', 'ศักดี', 'ม.6/1'),
(99, 17, '22167', 'น.ส.', 'ศุภิสรา', 'วงศาวิเศษ', 'ม.6/1'),
(100, 18, '22173', 'น.ส.', 'ไอริสา', 'แก้วศรีจันทร์', 'ม.6/1'),
(101, 19, '22195', 'น.ส.', 'ญดาวรรณ', 'ยะสุราช', 'ม.6/1'),
(102, 20, '22243', 'น.ส.', 'ฐิตินันท์', 'สนโต', 'ม.6/1'),
(103, 21, '22261', 'น.ส.', 'สุธิดากร', 'เจริญธรรม', 'ม.6/1'),
(104, 22, '22341', 'น.ส.', 'เบญญาภา', 'ค้ำโลก', 'ม.6/1'),
(105, 23, '22350', 'น.ส.', 'สุกานดา', 'เจื้อจิ๋ว', 'ม.6/1'),
(106, 24, '22663', 'น.ส.', 'ณัฏฐณิชา', 'คำไทย', 'ม.6/1'),
(107, 25, '22692', 'น.ส.', 'ดวงหทัย', 'ไชยกูล', 'ม.6/1'),
(108, 26, '24400', 'น.ส.', 'กนกวรรณ', 'หุตะเจริญ', 'ม.6/1'),
(109, 27, '24401', 'น.ส.', 'ฐิติยากร', 'จันโท', 'ม.6/1'),
(110, 28, '24402', 'น.ส.', 'ณปภา', 'เลิศรักษา', 'ม.6/1'),
(111, 29, '24403', 'น.ส.', 'ณัฏฐณิชา', 'ท้อยชัยภูมิ', 'ม.6/1'),
(112, 30, '24404', 'น.ส.', 'ดาวิน', 'อินต๊ะ', 'ม.6/1'),
(113, 31, '24405', 'น.ส.', 'นัชชา', 'รัตนเสถียร', 'ม.6/1'),
(114, 32, '24406', 'น.ส.', 'พลอยนภัส', 'พัชรประไพ', 'ม.6/1'),
(115, 33, '24408', 'น.ส.', 'วิรวรรณ', 'พันธสีมา', 'ม.6/1'),
(116, 34, '24409', 'น.ส.', 'สาวิตรี', 'ตุ้มไธสง', 'ม.6/1'),
(117, 35, '24410', 'น.ส.', 'หทัยรัตน์', 'อินทโชติ', 'ม.6/1'),
(118, 36, '24411', 'น.ส.', 'อัจฉรา', 'พรรค์พิทักษ์', 'ม.6/1'),
(119, 37, '24412', 'น.ส.', 'อาภัสรา', 'สิทธิโชคเหล่าทอง', 'ม.6/1'),
(120, 38, '24413', 'น.ส.', 'อุษสรา', 'ภูกองชัย', 'ม.6/1'),
(121, 1, '22110', 'นาย', 'ธนวิน', 'สุขสว่าง', 'ม.6/2'),
(122, 2, '22111', 'นาย', 'นราธิป', 'จอนงามเนตร', 'ม.6/2'),
(123, 3, '22112', 'นาย', 'ปรินทร์', 'แก้วศรีวงค์', 'ม.6/2'),
(124, 4, '22116', 'นาย', 'ศรัณย์ภัทร์', 'อุทุมทอง', 'ม.6/2'),
(125, 5, '22220', 'นาย', 'จิรภัทร', 'เนื่องจํานงค์', 'ม.6/2'),
(126, 6, '22230', 'นาย', 'วรัญญู', 'เกษรัตน์', 'ม.6/2'),
(127, 7, '22234', 'นาย', 'อภินันท์', 'มากะนัตถุ์', 'ม.6/2'),
(128, 8, '22312', 'นาย', 'กิตตินันท์', 'เหลืองอ่อน', 'ม.6/2'),
(129, 9, '22448', 'นาย', 'จักริน', 'คำด้วง', 'ม.6/2'),
(130, 10, '22466', 'นาย', 'วิทยา', 'เปรื่องวิชา', 'ม.6/2'),
(131, 11, '24415', 'นาย', 'คณวัต', 'นิธิประดิษฐกุล', 'ม.6/2'),
(132, 12, '24416', 'นาย', 'บวรวิชญ์', 'สุนทรสารทูล', 'ม.6/2'),
(133, 13, '24417', 'นาย', 'ปริตต์', 'แก้วศรีวงค์', 'ม.6/2'),
(134, 14, '24418', 'นาย', 'ภัทรกร', 'ศรีสำราญ', 'ม.6/2'),
(135, 15, '24453', 'นาย', 'ณัฐพงศ์', 'เมินดี', 'ม.6/2'),
(136, 16, '22126', 'น.ส.', 'นารา', 'แสงพิณทอง', 'ม.6/2'),
(137, 17, '22128', 'น.ส.', 'พิชชาพร', 'ปัญญานนท์', 'ม.6/2'),
(138, 18, '22151', 'น.ส.', 'เกวลิน', 'ดาวเรรัมย์', 'ม.6/2'),
(139, 19, '22163', 'น.ส.', 'วิรากร', 'ชัยบังคม', 'ม.6/2'),
(140, 20, '22192', 'น.ส.', 'ขวัญ​มีนา​', 'บุญ​ยอด​', 'ม.6/2'),
(141, 21, '22193', 'น.ส.', 'ชนิภรณ์', 'พุ่มประดิษฐ์', 'ม.6/2'),
(142, 22, '22196', 'น.ส.', 'ญาณวดี', 'นิติสิทธ์', 'ม.6/2'),
(143, 23, '22200', 'น.ส.', 'ธัญพิชชา', 'โชคสุนทรมนัส', 'ม.6/2'),
(144, 24, '22205', 'น.ส.', 'พัชรินทร์', 'เต็มศิริ', 'ม.6/2'),
(145, 25, '22210', 'น.ส.', 'ศรัญญา', 'พูลสวัสดิ์', 'ม.6/2'),
(146, 26, '22245', 'น.ส.', 'ดวงกมล', 'นุตาดี', 'ม.6/2'),
(147, 27, '22251', 'น.ส.', 'ปัณฑารีย์', 'จูงใจ', 'ม.6/2'),
(148, 28, '22255', 'น.ส.', 'วนัชนันท์', 'เพ่งพินิจ', 'ม.6/2'),
(149, 29, '22259', 'น.ส.', 'สรัลชนา', 'วันชนะ', 'ม.6/2'),
(150, 30, '22282', 'น.ส.', 'กัญญรัตน์', 'สิงห์โท', 'ม.6/2'),
(151, 31, '22307', 'น.ส.', 'สุพิชชา', 'เชยสุนทร', 'ม.6/2'),
(152, 32, '22346', 'น.ส.', 'ยศวดี', 'ลาภอุดมทรัพย์', 'ม.6/2'),
(153, 33, '22426', 'น.ส.', 'กรรณิการ์', 'กันตา', 'ม.6/2'),
(154, 34, '22664', 'น.ส.', 'สุพิชญา', 'สุรินทะ', 'ม.6/2'),
(155, 35, '22672', 'น.ส.', 'ธิดาเทพ', 'บุญชม', 'ม.6/2'),
(156, 36, '23281', 'น.ส.', 'ฑิตยา', 'บุตรธรรมมา', 'ม.6/2'),
(157, 37, '24419', 'น.ส.', 'ปัณฑา', 'อนาวงค์เจริญ', 'ม.6/2'),
(158, 38, '24420', 'น.ส.', 'อรกัญญา', 'ธนะจันทร์', 'ม.6/2'),
(159, 39, '24502', 'น.ส.', 'ธัญญรัศม์', ' พรงาม', 'ม.6/2'),
(160, 1, '22175', 'นาย', 'กิตตินันท์', 'เจริญสิรภัทร', 'ม.6/3'),
(161, 2, '22179', 'นาย', 'ณัฐพล', 'เปรมปรีดิ์พร', 'ม.6/3'),
(162, 3, '22231', 'นาย', 'วิศรุต', 'ศรีเกษม', 'ม.6/3'),
(163, 4, '22232', 'นาย', 'วีร​พล​', 'ทองธ​นา​เช​ษ​ฐ​์​', 'ม.6/3'),
(164, 5, '22233', 'นาย', 'ศรีวิชัย', 'ใจเยือกเย็น', 'ม.6/3'),
(165, 6, '22317', 'นาย', 'ทรงกรต', 'สุวรรณจารี', 'ม.6/3'),
(166, 7, '22365', 'นาย', 'นราวิชญ์', 'นันทชลากรกิจ', 'ม.6/3'),
(167, 8, '22596', 'นาย', 'ศุภฤกษ์', 'มุสะนะ', 'ม.6/3'),
(168, 9, '24421', 'นาย', 'กรวัฒน์', 'ป้องพิมพ์', 'ม.6/3'),
(169, 10, '24422', 'นาย', 'กีรติ', 'เทพรักษ์', 'ม.6/3'),
(170, 11, '24424', 'นาย', 'ธนายุทธ', 'สมสถาน', 'ม.6/3'),
(171, 12, '24425', 'นาย', 'นวินพรรษ', 'กนกกรพิศุทธิ์', 'ม.6/3'),
(172, 13, '24426', 'นาย', 'พีรวัส', 'ณรงค์นอก', 'ม.6/3'),
(173, 14, '24427', 'นาย', 'ภาสวร', 'ศรีศักดิ์', 'ม.6/3'),
(174, 15, '24428', 'นาย', 'ศุภณัฐ', 'ติยะสุทธิพันธุ์', 'ม.6/3'),
(175, 16, '24429', 'นาย', 'อนันต์สิทธิ์', 'แป้นเกิด', 'ม.6/3'),
(176, 17, '24503', 'นาย', 'กันตณัฐ  ', 'พงษ์ชมพร', 'ม.6/3'),
(177, 18, '22169', 'น.ส.', 'สุพิชญา', 'พระสมสุข', 'ม.6/3'),
(178, 19, '22197', 'น.ส.', 'ญานิกา', 'คำสุนทะ', 'ม.6/3'),
(179, 20, '22198', 'น.ส.', 'ณัฐฐินันท์', 'บำรุงจิต', 'ม.6/3'),
(180, 21, '22217', 'น.ส.', 'อัญชสา', 'กอบการุณ', 'ม.6/3'),
(181, 22, '22236', 'น.ส.', 'กนกวรรณ', 'จันทร์ลอย', 'ม.6/3'),
(182, 23, '22241', 'น.ส.', 'จันทิมา', 'สังข์ทอง', 'ม.6/3'),
(183, 24, '22246', 'น.ส.', 'ธนัญญา', 'เทศสวัสดิ์', 'ม.6/3'),
(184, 25, '22285', 'น.ส.', 'กานต์ธิดา', 'อนันตกูล', 'ม.6/3'),
(185, 26, '22290', 'น.ส.', 'ชาลิณี', 'พ่วงแจ่ม', 'ม.6/3'),
(186, 27, '22294', 'น.ส.', 'ธนัญญา', 'จิตเสงี่ยม', 'ม.6/3'),
(187, 28, '22305', 'น.ส.', 'ศุภิสรา', 'พวงประยงค์', 'ม.6/3'),
(188, 29, '22353', 'น.ส.', 'อิสริยา', 'รุจิรัตน์', 'ม.6/3'),
(189, 30, '22474', 'น.ส.', 'เกศมณี', 'รอดจินดา', 'ม.6/3'),
(190, 31, '22530', 'น.ส.', 'วาศิณี', 'ภู่สอน', 'ม.6/3'),
(191, 32, '22607', 'น.ส.', 'ณวิพา', 'บุญรอด', 'ม.6/3'),
(192, 33, '24430', 'น.ส.', 'กรพินท์', 'ไชยเทพ', 'ม.6/3'),
(193, 34, '24432', 'น.ส.', 'นภาทิพย์', 'ทองเย็น', 'ม.6/3'),
(194, 35, '24433', 'น.ส.', 'พรนภัส', 'รุ่งเรือง', 'ม.6/3'),
(195, 36, '24434', 'น.ส.', 'ฟ้าใส', 'ซำพันธ์', 'ม.6/3'),
(196, 37, '24435', 'น.ส.', 'สุวิตรา', 'สามารถ', 'ม.6/3'),
(197, 38, '24504', 'น.ส.', 'กรรณิกา ', 'เมืองคุ้ม', 'ม.6/3'),
(198, 39, '24505', 'น.ส.', 'อภิชญาภา ', ' งามเมืองปัก', 'ม.6/3'),
(199, 1, '22139', 'นาย', 'ธีรวัสส์  ', 'ประเสริฐ', 'ม.6/4'),
(200, 2, '22268', 'นาย', 'ธนะพันธ์', 'จันทสะเร', 'ม.6/4'),
(201, 3, '22276', 'นาย', 'วีรวิชญ์', 'โพธิสมพรชัย', 'ม.6/4'),
(202, 4, '22363', 'นาย', 'ธีรวัฒน์', 'เมษกระชา', 'ม.6/4'),
(203, 5, '22417', 'นาย', 'รัฐภูมิ', 'ตากมัจฉา', 'ม.6/4'),
(204, 6, '22419', 'นาย', 'วรายุ', 'หมายเเก้วกลาง', 'ม.6/4'),
(205, 7, '22420', 'นาย', 'ศิริมง​คล​', 'ศรีมงคล', 'ม.6/4'),
(206, 8, '22446', 'นาย', 'ไกรสร', 'ทนโนนแดง', 'ม.6/4'),
(207, 9, '22447', 'นาย', 'ชยกฤต', 'นีลดานุวงศ์', 'ม.6/4'),
(208, 10, '22539', 'นาย', 'ณัฐกานต์', 'เกิดปราง', 'ม.6/4'),
(209, 11, '22671', 'นาย', 'ทินภัทร', 'มาพงษ์', 'ม.6/4'),
(210, 12, '24437', 'นาย', 'กรวิทย์', 'ป้องพิมพ์', 'ม.6/4'),
(211, 13, '24438', 'นาย', 'เจษฎา', 'ไชยโกษ', 'ม.6/4'),
(212, 14, '24439', 'นาย', 'ชลธี', 'ฮวดลิ้ม', 'ม.6/4'),
(213, 15, '24440', 'นาย', 'ชัยโรจน์', 'ดงงาม', 'ม.6/4'),
(214, 16, '24441', 'นาย', 'ธิติวุฒิ', 'ศิรินาท', 'ม.6/4'),
(215, 17, '24442', 'นาย', 'ปฐมพงษ์', 'ส่งเสริม', 'ม.6/4'),
(216, 18, '25131', 'นาย', 'เบญจมินทร์', 'สมชาติ', 'ม.6/4'),
(217, 19, '22154', 'น.ส.', 'นราทิพย์', 'แซ่โง้ว', 'ม.6/4'),
(218, 20, '22155', 'น.ส.', 'นันทิชา', 'เอี้ยงกลาง', 'ม.6/4'),
(219, 21, '22238', 'น.ส.', 'กุนธิดา', 'สุวรรณ์', 'ม.6/4'),
(220, 22, '22298', 'น.ส.', 'ปนัสยา', 'แสงชู', 'ม.6/4'),
(221, 23, '22300', 'น.ส.', 'มนัสนันท์', 'นันทไชย', 'ม.6/4'),
(222, 24, '22326', 'น.ส.', 'กชกร', 'เย็นอุรา', 'ม.6/4'),
(223, 25, '22347', 'น.ส.', 'ลลนา', 'พูนเกษม', 'ม.6/4'),
(224, 26, '22521', 'น.ส.', 'พงศ์ภรณ์', 'นันทมลวารี', 'ม.6/4'),
(225, 27, '22532', 'น.ส.', 'ศุภนิชา', 'สุขบรรเทิง', 'ม.6/4'),
(226, 28, '22609', 'น.ส.', 'ธนภรณ์', 'อรรคจันทร์', 'ม.6/4'),
(227, 29, '22619', 'น.ส.', 'วรัญญา', 'โพธิ์ทอง', 'ม.6/4'),
(228, 30, '22670', 'น.ส.', 'นภัสกรณ์', 'พลับพลี', 'ม.6/4'),
(229, 31, '24444', 'น.ส.', 'เจนจิรา', 'สาระวัน', 'ม.6/4'),
(230, 32, '24445', 'น.ส.', 'ฉันทิศา', 'นามวัฒน์', 'ม.6/4'),
(231, 33, '24446', 'น.ส.', 'ชนิตา', 'คงเจริญ', 'ม.6/4'),
(232, 34, '24447', 'น.ส.', 'ชุติกาญจน์', 'นพรัตน์', 'ม.6/4'),
(233, 35, '24448', 'น.ส.', 'พลอยรัตน์', 'ฉัตรัตติกรณ์', 'ม.6/4'),
(234, 36, '24449', 'น.ส.', 'พัทธนันท์', 'ช่างปลูก', 'ม.6/4'),
(235, 37, '24450', 'น.ส.', 'มิณิสรา', 'ดุริยปราณีต', 'ม.6/4'),
(236, 38, '24451', 'น.ส.', 'ศรัญญาพร', 'พานแก้ว', 'ม.6/4'),
(237, 39, '24452', 'น.ส.', 'ศศิธร', 'วัฒนาผลสุข', 'ม.6/4'),
(238, 40, '24476', 'น.ส.', 'ทรัตน์ฉัตร์', 'วุฒิสิทธิญาณ', 'ม.6/4'),
(239, 1, '22115', 'นาย', 'วงศกร', 'เพ็ชรวาว', 'ม.6/5'),
(240, 2, '22117', 'นาย', 'ศุภกร', 'สุกใส', 'ม.6/5'),
(241, 3, '22180', 'นาย', 'ธนศร', 'จินตเศรณี', 'ม.6/5'),
(242, 4, '22222', 'นาย', 'ธนภัทร', 'บุญประเสริฐ', 'ม.6/5'),
(243, 5, '22226', 'นาย', 'ภาคิน', 'โคลงพิมาย', 'ม.6/5'),
(244, 6, '22315', 'นาย', 'ฉัตรรวี', 'เต็มใจกูล', 'ม.6/5'),
(245, 7, '22416', 'นาย', 'มูฮัมมัด', 'บุญนาค', 'ม.6/5'),
(246, 8, '22444', 'นาย', 'กฤตมุข', 'ท่าไชย', 'ม.6/5'),
(247, 9, '22470', 'นาย', 'อมลวัทน์', 'นาควัชรางกูร', 'ม.6/5'),
(248, 10, '22506', 'นาย', 'ภัทรพล', 'พลพุฒ', 'ม.6/5'),
(249, 11, '22557', 'นาย', 'อธิชาติ', 'สมศักดิ์', 'ม.6/5'),
(250, 12, '24454', 'นาย', 'นฤเบศทร์', 'เสนาพล', 'ม.6/5'),
(251, 13, '24455', 'นาย', 'นิธิโรจน์', 'สินธุธนะรัตน์', 'ม.6/5'),
(252, 14, '24456', 'นาย', 'รพีภัทร', 'จิตต์ผล', 'ม.6/5'),
(253, 15, '24506', 'นาย', 'หัสดี ', ' สังขะโห', 'ม.6/5'),
(254, 16, '21959', 'น.ส.', 'ธีรนาฏ', 'ไตรศุภโชค', 'ม.6/5'),
(255, 17, '22130', 'น.ส.', 'ลมิตา', 'โพธิ์มี', 'ม.6/5'),
(256, 18, '22211', 'น.ส.', 'สโรชา', 'ฉ่ำก๋ง', 'ม.6/5'),
(257, 19, '22216', 'น.ส.', 'อภิญญา', 'เสพสุข', 'ม.6/5'),
(258, 20, '22247', 'น.ส.', 'เนตรดาว', 'วุฒิยาสาร', 'ม.6/5'),
(259, 21, '22287', 'น.ส.', 'จารุวรรณ', 'วัฒนกุลัง', 'ม.6/5'),
(260, 22, '22306', 'น.ส.', 'สุชีรา', 'สุขเจริญ', 'ม.6/5'),
(261, 23, '22345', 'น.ส.', 'ภริตา', 'รุ่งเรือง', 'ม.6/5'),
(262, 24, '22560', 'น.ส.', 'ณัฐณิชา', 'อุทัยศรี', 'ม.6/5'),
(263, 25, '22662', 'น.ส.', 'จตุรภัทร', 'พิศวง', 'ม.6/5'),
(264, 26, '24459', 'น.ส.', 'จิดาภา', 'พะพู่', 'ม.6/5'),
(265, 27, '24460', 'น.ส.', 'ชลดา', 'คงเจริญ', 'ม.6/5'),
(266, 28, '24461', 'น.ส.', 'ชลดา', 'ภิรมย์กุลนันท์', 'ม.6/5'),
(267, 29, '24462', 'น.ส.', 'ญดาพร', 'พงษ์จินดา', 'ม.6/5'),
(268, 30, '24464', 'น.ส.', 'ณัฐธิดา', 'แกล้วกลัด', 'ม.6/5'),
(269, 31, '24465', 'น.ส.', 'ณัฐธิดาพร', 'แสวงวงค์', 'ม.6/5'),
(270, 32, '24466', 'น.ส.', 'ปาริชาติ', 'กุลนะ', 'ม.6/5'),
(271, 33, '24467', 'น.ส.', 'ปิ่นบังอร', 'รวมภักดี', 'ม.6/5'),
(272, 34, '24468', 'น.ส.', 'ปุญญิสา', 'ทองแดง', 'ม.6/5'),
(273, 35, '24469', 'น.ส.', 'พรปวีณ์', 'ประเสริฐธีระชัย', 'ม.6/5'),
(274, 36, '24470', 'น.ส.', 'ศิริฉัตร', 'สอาดเอี่ยม', 'ม.6/5'),
(275, 37, '24471', 'น.ส.', 'สุภัชชา', 'นพเก้า', 'ม.6/5'),
(276, 38, '24472', 'น.ส.', 'หฤทัย', 'ลอดบุญมา', 'ม.6/5'),
(277, 39, '24477', 'น.ส.', 'ณัฏฐวรรณ', 'ผลเจริญศรี', 'ม.6/5'),
(278, 40, '25077', 'น.ส.', 'ณัฐชานันท์', 'เทิดประสิทธิกุล', 'ม.6/5'),
(279, 1, '22137', 'นาย', 'ธนกฤต', 'สิงห์ทอง', 'ม.6/6'),
(280, 2, '22140', 'นาย', 'นัฐพงค์', 'แสนเสมอใจ', 'ม.6/6'),
(281, 3, '22141', 'นาย', 'นิธิกร', 'สมพันธ์', 'ม.6/6'),
(282, 4, '22191', 'นาย', 'ฮินซาน', 'เมืองยศ', 'ม.6/6'),
(283, 5, '22267', 'นาย', 'ธนภัทร', 'จอมจันทร์', 'ม.6/6'),
(284, 6, '22309', 'นาย', 'กฤษกร', 'ถาวรวัฒนผล', 'ม.6/6'),
(285, 7, '22316', 'นาย', 'ณัฐวุฒิ', 'นุศิษย์ภาพ', 'ม.6/6'),
(286, 8, '22318', 'นาย', 'นนทพัทธ์', 'เรืองหิรัญวนิช', 'ม.6/6'),
(287, 9, '22490', 'นาย', 'จักรภัทร', 'สว่างวรรณรัตน์', 'ม.6/6'),
(288, 10, '22122', 'น.ส.', 'ชนาภัทร', 'จันทราเทพ', 'ม.6/6'),
(289, 11, '22150', 'น.ส.', 'กานต์รวี', 'จันทร', 'ม.6/6'),
(290, 12, '22159', 'น.ส.', 'พิมพ์นิภา', 'มหากัณฑ์', 'ม.6/6'),
(291, 13, '22160', 'น.ส.', 'รัชญากรณ์', 'แสงสุรินทร์', 'ม.6/6'),
(292, 14, '22171', 'น.ส.', 'อริสรา', 'ชัยประหลาด', 'ม.6/6'),
(293, 15, '22172', 'น.ส.', 'อัคษราภัค', 'สายสิงห์', 'ม.6/6'),
(294, 16, '22203', 'น.ส.', 'นันทิกานต์', 'ลาพิพัฒน์', 'ม.6/6'),
(295, 17, '22209', 'น.ส.', 'วาณิชกร', 'วาณิชยากรกุล', 'ม.6/6'),
(296, 18, '22240', 'น.ส.', 'เขมจิรา', 'ปุราชะทำมัง', 'ม.6/6'),
(297, 19, '22254', 'น.ส.', 'พิมพ์สกุล', 'ฉวีวรรณ', 'ม.6/6'),
(298, 20, '22260', 'น.ส.', 'สโรชินี', 'พลสีลา', 'ม.6/6'),
(299, 21, '22283', 'น.ส.', 'กัญญาณัฐ', 'สายอากาศ', 'ม.6/6'),
(300, 22, '22286', 'น.ส.', 'เกศินี', 'พัฒนศรีสกุล', 'ม.6/6'),
(301, 23, '22292', 'น.ส.', 'ณัฐชา', 'จิรชยาชุติสิริ', 'ม.6/6'),
(302, 24, '22301', 'น.ส.', 'วริศนันท์', 'เจียวประเสริฐ', 'ม.6/6'),
(303, 25, '22303', 'น.ส.', 'ศลิษา', 'กิจวรรณ', 'ม.6/6'),
(304, 26, '22330', 'น.ส.', 'ชวิศา', 'ราศรีจันทร์', 'ม.6/6'),
(305, 27, '22331', 'น.ส.', 'ฐิตารีย์', 'พัดทอง', 'ม.6/6'),
(306, 28, '22332', 'น.ส.', 'ณัฐชา', 'บุญประเสริฐ', 'ม.6/6'),
(307, 29, '22333', 'น.ส.', 'ณัฐธิดา', 'จิรชยาชุติสิริ', 'ม.6/6'),
(308, 30, '22334', 'น.ส.', 'ณิชากร', 'คำหลวง', 'ม.6/6'),
(309, 31, '22336', 'น.ส.', 'ธิติมา', 'นะทีศรี', 'ม.6/6'),
(310, 32, '22339', 'น.ส.', 'นัศลียา', 'เหมมัน', 'ม.6/6'),
(311, 33, '22344', 'น.ส.', 'พัชญ์ทิตา', 'นาคแหลม', 'ม.6/6'),
(312, 34, '22348', 'น.ส.', 'ลลิดา', 'เสมามิ่ง', 'ม.6/6'),
(313, 35, '22430', 'น.ส.', 'ชลธิชา', 'บุญภู่', 'ม.6/6'),
(314, 36, '22487', 'น.ส.', 'ศิรภัสสร', 'พงษ์พิละ', 'ม.6/6'),
(315, 37, '22565', 'น.ส.', 'ปทิตตา', 'อึ๊งสุวรรณนที', 'ม.6/6'),
(316, 38, '24473', 'น.ส.', 'จนิตรา', 'จันทร์ตรา', 'ม.6/6'),
(317, 39, '24474', 'น.ส.', 'ศศินันท์', 'เฉิน', 'ม.6/6'),
(318, 40, '24475', 'น.ส.', 'อาริตา', 'ราชนาวี', 'ม.6/6'),
(319, 1, '22698', 'นาย', 'ธนกฤต', 'ไชยปรีชา', 'ม.5/1');

-- --------------------------------------------------------

--
-- Table structure for table `tb_work`
--

CREATE TABLE `tb_work` (
  `work_id` int(11) NOT NULL,
  `course_id` int(11) NOT NULL,
  `work_name` varchar(100) NOT NULL,
  `full_score` varchar(100) NOT NULL,
  `work_type` varchar(100) NOT NULL,
  `target_room` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_work`
--

INSERT INTO `tb_work` (`work_id`, `course_id`, `work_name`, `full_score`, `work_type`, `target_room`) VALUES
(9, 2, '1. Vocabulary Unit 4', '10', '1', 'grade:ม.6'),
(10, 2, '2. Conditional Sentence', '10', '1', 'grade:ม.6'),
(11, 3, 'Vocabulary Test 1', '15', '1', 'grade:ม.5');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_course_info`
--
ALTER TABLE `tb_course_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_exam_answer_log`
--
ALTER TABLE `tb_exam_answer_log`
  ADD PRIMARY KEY (`log_id`);

--
-- Indexes for table `tb_exam_questions`
--
ALTER TABLE `tb_exam_questions`
  ADD PRIMARY KEY (`question_id`);

--
-- Indexes for table `tb_exam_results`
--
ALTER TABLE `tb_exam_results`
  ADD PRIMARY KEY (`result_id`);

--
-- Indexes for table `tb_exam_sets`
--
ALTER TABLE `tb_exam_sets`
  ADD PRIMARY KEY (`exam_id`);

--
-- Indexes for table `tb_score`
--
ALTER TABLE `tb_score`
  ADD PRIMARY KEY (`score_id`);

--
-- Indexes for table `tb_students`
--
ALTER TABLE `tb_students`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_work`
--
ALTER TABLE `tb_work`
  ADD PRIMARY KEY (`work_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_course_info`
--
ALTER TABLE `tb_course_info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `tb_exam_answer_log`
--
ALTER TABLE `tb_exam_answer_log`
  MODIFY `log_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tb_exam_questions`
--
ALTER TABLE `tb_exam_questions`
  MODIFY `question_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `tb_exam_results`
--
ALTER TABLE `tb_exam_results`
  MODIFY `result_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tb_exam_sets`
--
ALTER TABLE `tb_exam_sets`
  MODIFY `exam_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tb_score`
--
ALTER TABLE `tb_score`
  MODIFY `score_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tb_students`
--
ALTER TABLE `tb_students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=320;

--
-- AUTO_INCREMENT for table `tb_work`
--
ALTER TABLE `tb_work`
  MODIFY `work_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
